tutorials/annulus/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (10 0 0);

boundaryField
{
    inlet
    {
        type            syntheticTurbulenceInlet;
        value           uniform (10 0 0);
        geometryMode    annulus; //Required; Choose between: an annulus, a disk, a rectangle, and a channel (rectangle with PBC in one direction)

        Umean           10.0; //mean speed in the main flow direction
        //Utau            -10; // friction velocity; Default: Utau is calculated from the expression for a smooth pipe (the lower limit can be forced by e.g. a negative value)
        //swirlNr         0.0; //swirl number; Default: 0.

        //d               1; //Ratio of sum of eddy volumes to eddy box volume, i.e. eddy density; Default: 1.
        //nCellPerEddy    1; //Minimum eddy length in units of number of cells; Default: 5.
        //scale           1; //Heuristic scaling factor (scales U'); Default: 1.
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    "procBoundary.*"
    {
        type processor;
        value $internalField;
    }

}
