tutorials/annulus/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}

application     foamRun;

solver          incompressibleFluid;

/* startFrom       startTime; */
startFrom       latestTime;

startTime       0.0;

stopAt          endTime;

endTime         2e-6;

deltaT          1e-7;

writeControl    adjustableRunTime;

writeInterval   1e-7;

purgeWrite 	    0;

writeFormat     ascii;//binary;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.8;

maxDi           0.7;

libs
(
"libsyntheticTurbulenceInlet.so"
);

functions
{
  #includeFunc    patchSurface
}


// ************************************************************************* //
